; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v2 - type_3 ?v3 - type_2)
 	      (pred_4 ?v7 - object ?v3 - type_2)
	      (pred_2 ?v2 - type_3 ?v4 - type_1)
	      (pred_3 ?v2 - type_3 ?v7 - object ?v4 - type_1))

   (:action op_3
       :parameters  (?v2 - type_3 ?v8 ?v1 - type_2)
       :precondition (and  (pred_1 ?v2 ?v8))
       :effect (and  (pred_1 ?v2 ?v1)
		     (not (pred_1 ?v2 ?v8))))

   (:action op_1
       :parameters (?v2 - type_3 ?v5 - object ?v6 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v5 ?v6) (pred_1 ?v2 ?v6) (pred_2 ?v2 ?v4))
       :effect (and (pred_3 ?v2 ?v5 ?v4)
		    (not (pred_4 ?v5 ?v6)) 
		    (not (pred_2 ?v2 ?v4))))

   (:action op_2
       :parameters (?v2 - type_3 ?v5 - object ?v6 - type_2 ?v4 - type_1)
       :precondition  (and  (pred_3 ?v2 ?v5 ?v4) (pred_1 ?v2 ?v6))
       :effect (and (pred_4 ?v5 ?v6)
		    (pred_2 ?v2 ?v4)
		    (not (pred_3 ?v2 ?v5 ?v4)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_10 - type_3
obj_06 obj_04 - type_1
obj_09 obj_07 obj_02 obj_08 - type_2
obj_05 obj_03 obj_01 - object)
(:init
(pred_1 obj_10 obj_07)
(pred_2 obj_10 obj_06)
(pred_2 obj_10 obj_04)
(pred_4 obj_05 obj_09)
(pred_4 obj_03 obj_08)
(pred_4 obj_01 obj_02)
)
(:goal
(and
(pred_4 obj_05 obj_08)
(pred_4 obj_03 obj_07)
(pred_4 obj_01 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_10 ?b obj_04))))
)
)

; plan
1. (op_3 obj_10 obj_07 obj_09)
   deleted: (pred_1 obj_10 obj_07)
   added: (pred_1 obj_10 obj_09)
   goals met: 0 of 3
2. (op_1 obj_10 obj_05 obj_09 obj_06)
   deleted: (pred_4 obj_05 obj_09) (pred_2 obj_10 obj_06)
   added: (pred_3 obj_10 obj_05 obj_06)
   goals met: 0 of 3
3. (op_3 obj_10 obj_09 obj_08)
   deleted: (pred_1 obj_10 obj_09)
   added: (pred_1 obj_10 obj_08)
   goals met: 0 of 3
4. (op_2 obj_10 obj_05 obj_08 obj_06)
   deleted: (pred_3 obj_10 obj_05 obj_06)
   added: (pred_4 obj_05 obj_08) (pred_2 obj_10 obj_06)
   goals met: 1 of 3
5. (op_1 obj_10 obj_03 obj_08 obj_06)
   deleted: (pred_4 obj_03 obj_08) (pred_2 obj_10 obj_06)
   added: (pred_3 obj_10 obj_03 obj_06)
   goals met: 1 of 3
6. (op_3 obj_10 obj_08 obj_07)
   deleted: (pred_1 obj_10 obj_08)
   added: (pred_1 obj_10 obj_07)
   goals met: 1 of 3
7. (op_2 obj_10 obj_03 obj_07 obj_06)
   deleted: (pred_3 obj_10 obj_03 obj_06)
   added: (pred_4 obj_03 obj_07) (pred_2 obj_10 obj_06)
   goals met: 2 of 3
8. (op_3 obj_10 obj_07 obj_02)
   deleted: (pred_1 obj_10 obj_07)
   added: (pred_1 obj_10 obj_02)
   goals met: 2 of 3
9. (op_1 obj_10 obj_01 obj_02 obj_06)
   deleted: (pred_4 obj_01 obj_02) (pred_2 obj_10 obj_06)
   added: (pred_3 obj_10 obj_01 obj_06)
   goals met: 2 of 3
10. (op_3 obj_10 obj_02 obj_08)
   deleted: (pred_1 obj_10 obj_02)
   added: (pred_1 obj_10 obj_08)
   goals met: 2 of 3
11. (op_2 obj_10 obj_01 obj_08 obj_06)
   deleted: (pred_3 obj_10 obj_01 obj_06)
   added: (pred_4 obj_01 obj_08) (pred_2 obj_10 obj_06)
   goals met: 3 of 3
